<a href="https://colab.research.google.com/github/sireesharodda/simplilearn/blob/master/correlation_analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
df=pd.read_csv('Salaries.csv')
df.describe()

/opt/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3049: DtypeWarning: Columns (12) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes
count,148648.000000,148043.000000,148648.000000,148648.000000,112490.000000,148648.000000,148648.000000,148648.000000,0.0
mean,74326.110220,66325.398119,5065.821161,3648.761721,25007.777439,74770.035453,93694.776345,2012.522617,NaN
std,42911.633315,42764.898947,11454.266982,8056.655841,15402.235424,50516.440633,62792.743250,1.117526,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN
25%,37163.750000,33587.350000,0.000000,0.000000,11535.192500,36169.370000,44072.062500,2012.000000,NaN
50%,74326.500000,65007.450000,0.000000,811.205000,28628.365000,71427.130000,92406.020000,2013.000000,NaN
75%,111488.250000,94691.050000,4657.597500,4236.035000,35566.790000,105840.920000,132876.997500,2014.000000,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN

In [0]:
df[['BasePay','Year']].groupby(['Year']).describe()

      BasePay                                                             \
        count          mean           std     min         25%        50%
Year
2011  36158.0  63596.112293  40557.325014    0.00  33467.8075  62873.095
2012  36765.0  65435.950986  41782.686607 -166.01  34034.6400  64015.000
2013  37001.0  69630.030216  44237.113207   15.83  37021.5000  67669.000
2014  38119.0  66564.421924  44053.783972    0.00  30138.0550  65055.000


             75%        max
Year
2011  90650.6275  294580.02
2012  92428.9000  302578.00
2013  98272.5500  319275.01
2014  94735.0500  318835.49

In [0]:
df[['BasePay','Year']].groupby(['Year']).describe().unstack()

                Year
BasePay  count  2011     36158.000000
                2012     36765.000000
                2013     37001.000000
                2014     38119.000000
         mean   2011     63596.112293
                2012     65435.950986
                2013     69630.030216
                2014     66564.421924
         std    2011     40557.325014
                2012     41782.686607
                2013     44237.113207
                2014     44053.783972
         min    2011         0.000000
                2012      -166.010000
                2013        15.830000
                2014         0.000000
         25%    2011     33467.807500
                2012     34034.640000
                2013     37021.500000
                2014     30138.055000
         50%    2011     62873.095000
                2012     64015.000000
                2013     67669.000000
                2014     65055.000000
         75%    2011     90650.627500
                2012     92428.900000
                2013     98272.550000
                2014     94735.050000
         max    2011    294580.020000
                2012    302578.000000
                2013    319275.010000
                2014    318835.490000
dtype: float64

In [0]:
df[['BasePay','Year']].corr()

         BasePay     Year
BasePay  1.00000  0.03375
Year     0.03375  1.00000